snlkuharlocal/src/DataProcessors/ПроверкаВзаиморасчетов/ПроверкаВзаиморасчетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ПроверкаВзаиморасчетов</name>
</mdclass:DataProcessor>

snlkuharlocal/src/AccumulationRegisters/Взаиморасчеты/Взаиморасчеты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Взаиморасчеты</name>
  <resources>
    <name>СуммаВал</name>
    <comment>Сумма в рублях</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаУпр</name>
    <comment>Сумма в валюте расчетов</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>КодОперации</name>
    <type>
      <types>EnumRef.КодыОперацийОстатки</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаДокумента</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяДДС</name>
    <type>
      <types>CatalogRef.СтатьиЗатрат</types>
    </type>
  </attributes>
  <attributes>
    <name>Дата_НачалаЗадолженности</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Документ_ЗакрытогоПериода</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УИД_СтрокиПлатежа</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Договор</name>
    <type>
      <types>CatalogRef.Договоры</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

snlkuharlocal/src/DataProcessors/ПроверкаВзаиморасчетов/ObjectModule.bsl
Процедура Сформировать(ТаблицаПараметров=НЕОПРЕДЕЛЕНО) Экспорт
	Запрос = Новый запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Взаиморасчеты.Контрагент,
	|	Взаиморасчеты.Регистратор
	|ИЗ
	|	РегистрНакопления.Взаиморасчеты КАК Взаиморасчеты
	|ГДЕ
	|	Взаиморасчеты.Период МЕЖДУ &Дата1 И &Дата2
	|	И Взаиморасчеты.Контрагент.Владелец = &КолготкиМосква
	|	И Взаиморасчеты.Контрагент.Ведущий <> &ПустаяСсылка";
	Запрос.УстановитьПараметр("Дата1", НачалоДня(Константы.ДатаЗапретаРедактирования.Получить()+86400));
	Запрос.УстановитьПараметр("Дата2", КонецДня(ТекущаяДата()));
	Запрос.УстановитьПараметр("КолготкиМосква",Справочники.ИБ.НайтиПоКоду("SSP"));
	Запрос.УстановитьПараметр("ПустаяСсылка", Справочники.Контрагенты.ПустаяСсылка());
	Выборка = запрос.Выполнить().Выбрать();
	рег = РегистрыНакопления.Взаиморасчеты;
	Пока Выборка.Следующий() Цикл
		Объект = Выборка.Регистратор.ПолучитьОбъект();
		//Объект = Документы.РасходнаяНакладная.СоздатьДокумент();
		//Катаев+ 23/05/14
		//Объект.Записать(РежимЗаписиДокумента.Проведение);
		ЗаписатьВЛог("ПроверкаВзаиморасчетов","Производится перепроведение документа "+ Объект,"Информация");
		Если ТипЗнч(Объект) = Тип("ДокументОбъект.РасходнаяНакладная") Тогда
			Объект.ЗаписьПриПроверкиВзаиморасчетов();
		Иначе
			Объект.Записать(РежимЗаписиДокумента.Проведение);
		КонецЕсли;
		//Катаев- 23/05/14
		//НаборЗаписей = рег.СоздатьНаборЗаписей();
		//НаборЗаписей.Отбор.Регистратор.Значение = Выборка.Регистратор;
		//НаборЗаписей.Прочитать();
		//Данные = НаборЗаписей.Выгрузить();
		//Для Каждого стр из Данные Цикл
		//	стр.Контрагент = Выборка.Контрагент.Ведущий;
		//КонецЦикла;
		//НаборЗаписей.Загрузить(Данные);
		//НаборЗаписей.Записать();
	КонецЦикла;
КонецПроцедуры
